#include <stdio.h>
#include <stdlib.h>
#include "time.h"

int	main()
{
	int x, y, diff, abszer;

	printf("Приветствую тебя дорогой друг, предлагаю сыграть в игру, я загадал число от 1 до 100, твоя задача отгадать его, компьютер будет давать подсказки, удачи!) \n");
	srand(time(NULL));
	y = rand()%100;
	while (x != y)
	{
		printf("Введи число \n");
		scanf("%d", &x);
		diff = y - x;
		if ((diff <= 5 && diff >= 1) || (diff >= -5 && diff <= -1))
		{
			printf("Почти обжегся, ты рядом, ооооочень рядом :о \n");
		}
		if ((diff >= 6 && diff <= 9) || (diff <= -6 && diff >= -9))
		{
			printf("Горячее, продолжай :)) \n");
		}
		if ((diff >= 10 && diff <= 20) || (diff <= -10 && diff >= -20))
		{
			printf("Ты не далеко \n");
		}
		if ((diff >= 21 && diff <= 30) || (diff <= -21 && diff >= -30))
		{
			printf("Холодно, думай еще :) \n");
		}
		if ((diff >= 31 && diff <= 40) || (diff <= -31 && diff >= -40))
		{
			printf("Ооочень холодно -_- \n");
		}
		if ((diff >= 41 && diff <= 50) || (diff <= -41 && diff >= -50))
		{
			printf("Холоднее чем на северном полюсе (: \n");
		}
		if ((diff >= 51 && diff <= 69) || (diff <= -51 && diff >= -69))
		{
			printf("Холодно как при абсолютном нуле, а ты знаешь сколько это? Введи значение, может хоть здесь получится))\n");
			scanf("%d", &abszer);
			if (abszer == -273)
			{
				printf ("Молодец, продолжай играть))\n");
			}
			else
			{
				printf ("Ну.... ты пытался(-ась)");
			}
		}
		if ((diff >= 70 && diff < 100) || (diff <= -70 && diff > -99))
		{
			printf("Холоднее абсолютного нуля, попробуй еще :3 \n");
		}
		if (x > 100)
		{
			printf("Перечитай правила дружок-пирожок, от 1 до 100 -_- \n");
		}
		if (x < 1)
		{
			printf("Перечитай правила дружок-пирожок, от 1 до 100 -_- \n");
		}
		if (x == y)
		{
			printf("Поздравляю, ты победил, вот возьми 🎖️\n");
		}
	//	printf("chislo = %d \n",y); 
	}
}
